# Вопросы и ответы для теста "ПК 3.2"
questions_answers_pc3_2 = {
    "1": {
        "question": "Что следует сделать, если вы получили спам по e-mail с приложенным файлом?",
        "correct_answer": "Необходимо удалить письмо с приложением, не раскрывая (не читая) его."
    },
    "2": {
        "question": "Утечкой информации в системе называется ситуация, характеризуемая:",
        "options": ["1. Потерей данных в системе",
                    "2. Изменением формы информации",
                    "3. Изменением содержания информации"],
        "correct_answer": "1"
    },
    "3": {
        "question": "Программное обеспечение, пользователи которого имеют права на его неограниченную установку, запуск, использование, изучение, распространение и изменение называется.",
        "options": ["а) Свободное (открытое)",
                    "б) Проприетарное",
                    "в) Стандартное",
                    "г) Авторское"],
        "correct_answer": "а"
    },
    "4": {
        "question": "Дополните предложение. ______  являются наиболее рискованным для компании компонентом,  с точки зрения вероятного мошенничества и нарушения безопасности.",
        "correct_answer": "Сотрудники предприятия."
    },
    "5": {
        "question": "Установите соответствие между типами информации и их характеристиками: \n1: Визуальная информация - План эвакуации на стене \n2: Звуковая информация - Голосовое сообщение коллеги \n3: Тактильная информация - Горячий блок питания \n4: Обонятельная информация - Запах горелой проводки в кабинете",
        "correct_answer": "1 - а, 2 - б, 3 - в, 4 - г"
    },
    "6": {
        "question": "Выберите правильные ответы. За единицу измерения количества информации принимают: а) байт б) герц в) бит",
        "correct_answer": "а, в"
    },
    "7": {
        "question": "Поясние, для чего используется программа ABBYY FineReader.",
        "correct_answer": "Программа ABBYY FineReader предназначена для распознавания и преобразования текста, изображенного на бумажных документах, сканированных изображениях или файлов в формате PDF. Она предоставляет возможность преобразования бумажных документов в электронный формат, который можно редактировать, искать по ключевым словам и использовать для цифрового архивирования."
    },
    "8": {
        "question": "Дополните определение. Информацию, отражающую истинное положение дел, называют _______.",
        "correct_answer": "Достоверной"
    },
    "9": {
        "question": "Sale is the _____  of a product or service for money.",
        "options": ["а)  production",
                    "б)  creation",
                    "в)  exchange"],
        "correct_answer": "в"
    },
    "10": {
        "question": "Дополните определение. _______ - это наименьшая единица измерения количества информации. Может принимать значение 0 и 1.",
        "correct_answer": "Бит"
    },
    "11": {
        "question": "Выберите правильные ответы. Разрешающая способность изображения  НЕ характеризуется:\nа) Количеством точек на единицу длины \nб) Количеством цветов в изображении \nв) Количеством векторных объектов в изображении",
        "correct_answer": "б, в"
    },
    "12": {
        "question": "Дополните определение. _______ - это процесс преобразования информации из одной формы в другую, чтобы она могла быть передана и использована.",
        "correct_answer": "Кодирование информации"
    },
    "13": {
        "question": "Установите соответствие между понятием и его описанием: \n1: Аналоговое кодирование \n2: Цифровое кодирование \nа) Использует непрерывные аналоговые сигналы для представления информации \nб) Представляет информацию в дискретной форме с использованием комбинаций битов",
        "correct_answer": "1 - б, 2 - а"
    },
    "14": {
        "question": "Поясните, что такое компьютерная сеть.",
        "correct_answer": "Компьютерная сеть является совокупностью связанных компьютеров и других устройств, которые могут обмениваться данными и ресурсами друг с другом. Она позволяет компьютерам и устройствам взаимодействовать, обмениваться информацией, делиться файлами, печатать, обеспечивать доступ к общим ресурсам, например принтерам или хранилищам данных."
    },
    "15": {
        "question": "Поясните, как определить целевую аудиторию для продвижения программного обеспечения.",
        "correct_answer": "Целевую аудиторию можно определить на основе характеристик продукта и потенциальных пользователей, таких как возраст, пол, интересы, профессия и т.д."
    },
    "16": {
        "question": "Поясните, какие каналы коммуникации можно использовать для презентации программного обеспечения.",
        "correct_answer": "Для презентации ПО можно использовать различные каналы коммуникации, такие как вебинары, демонстрации в живую, видео-обзоры, статьи и т.д."
    },
    "17": {
        "question": "Упорядочите следующие типы файлов в порядке возрастания их предполагаемого размера:\n1. Текстовый документ (.txt) без форматирования. \n2. Аудиофайл (.mp3) длительностью 3 минуты. \n3. Фотография (.jpeg)  \n4. Видеозапись (.mp4) продолжительностью 10 минут.",
        "correct_answer": "1-3-4-2"
    },
    "18": {
        "question": "Укажите последовательность действий, чтобы установить фильтр на таблицу в Excel.\n1. выбрать команду ""Фильтр"" \n2. выбрать меню ""Данные""  \n3. выбрать (настроить) нужные параметры фильтрации",
        "correct_answer": "2 - 1 - 3"
    }
}
